waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Src/fm33fk5xx_fl_epsc.c
/**
  ****************************************************************************************************
  * @file    fm33fk5xx_fl_adc.c
  * @author  FMSH Application Team
  * @brief   Src file of EPSC FL Module
  ****************************************************************************************************
  * @attention
  *
  * Copyright (c) [2021] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under Mulan PSL v2.
  * You can use this software according to the terms and conditions of the Mulan PSL v2.
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
  * EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
  * MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
  * See the Mulan PSL v2 for more details.
  *
  ****************************************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "fm33fk5xx_fl.h"

/** @addtogroup fm33fk5xx_FL_Driver
  * @{
  */

/** @addtogroup EPSC
  * @{
  */

#ifdef FL_EPSC_DRIVER_ENABLED

/* Private macros ------------------------------------------------------------*/
/** @addtogroup EPSC_FL_Private_Macros
  * @{
  */

#define         IS_FL_EPSC_INSTANCE(INSTANCE)                   ((INSTANCE) == EPSC)

#define         IS_FL_EPSC_NORSRAM_BANK(__VALUE__)              (((__VALUE__) == FL_EPSC_BANK1_NORSRAM1)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_BANK1_NORSRAM2)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_BANK1_NORSRAM3)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_BANK1_NORSRAM4))

#define         IS_FL_EPSC_MUX(__VALUE__)                       (((__VALUE__) == FL_DISABLE)||\
                                                                                                                                    ((__VALUE__) == FL_ENABLE))

#define         IS_FL_EPSC_MEMORY(__VALUE__)                    (((__VALUE__) == FL_EPSC_NCR_MEMORY_TYPE_SRAM)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NCR_MEMORY_TYPE_PSRAM)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NCR_MEMORY_TYPE_NOR_FLASH))

#define         IS_FL_EPSC_MEMORY_WIDTH(__VALUE__)              (((__VALUE__) == FL_EPSC_NCR_MEMORY_WIDTH_8B)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NCR_MEMORY_WIDTH_16B))

#define         IS_FL_EPSC_BURSTMODE(__VALUE__)                 (((__VALUE__) == FL_DISABLE)||\
                                                                  ((__VALUE__) == FL_ENABLE))

#define         IS_FL_EPSC_WRITE_BURST(__VALUE__)               (((__VALUE__) == FL_EPSC_NCR_SYNC_MODE_ASYNC)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NCR_SYNC_MODE_SYNC))

#define         IS_FL_EPSC_WAITE_SIGNAL(__VALUE__)              (((__VALUE__) == FL_DISABLE)||\
                                                                                                                                    ((__VALUE__) == FL_ENABLE))

#define         IS_FL_EPSC_ASYNWAIT(__VALUE__)                  (((__VALUE__) == FL_DISABLE)||\
                                                                  ((__VALUE__) == FL_ENABLE))

#define         IS_FL_EPSC_WAIT_POLARITY(__VALUE__)             (((__VALUE__) == FL_EPSC_NCR_POLARITY_LOW)||\
                                                                  ((__VALUE__) == FL_EPSC_NCR_POLARITY_HIGH))

#define         IS_FL_EPSC_WAIT_SIGNAL_ACTIVE(__VALUE__)        (((__VALUE__) == FL_EPSC_NCR_ACTIVE_STATE_BEFORE)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NCR_ACTIVE_STATE_DURING))

#define         IS_FL_EPSC_WRITE_OPERATION(__VALUE__)           (((__VALUE__) == FL_DISABLE)||\
                                                                  ((__VALUE__) == FL_ENABLE))

#define         IS_FL_EPSC_EXTENDED_MODE(__VALUE__)             (((__VALUE__) == FL_DISABLE)||\
                                                                  ((__VALUE__) == FL_ENABLE))

#define         IS_FL_EPSC_ADDRESS_SETUP_TIME(__VALUE__)        ((__VALUE__) <= 0xF)

#define         IS_FL_EPSC_ADDRESS_HOLD_TIME(__VALUE__)         (((__VALUE__) > 0) && ((__VALUE__) <= 0xF))

#define         IS_FL_EPSC_DATASETUP_TIME(__VALUE__)            (((__VALUE__) > 0) && ((__VALUE__) <= 0xFF))

#define         IS_FL_EPSC_NTR_TURNAROUND_TIME(__VALUE__)       (((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_0CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_1CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_2CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_3CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_4CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_5CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_6CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_7CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_8CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_9CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_10CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_11CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_12CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_13CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_14CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_BUS_TRUNAROUND_15CLK))

#define         IS_FL_EPSC_NTR_CLK_DIV(__VALUE__)                   (((__VALUE__) == FL_EPSC_NTR_CLK_DIV2)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV3)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV4)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV5)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV6)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV7)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV8)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV9)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV10)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV11)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV12)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV13)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV14)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV15)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_CLK_DIV16))

#define         IS_FL_EPSC_NTR_DATA_LATENCY(__VALUE__)          (((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_2CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_3CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_4CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_5CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_6CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_7CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_8CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_9CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_10CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_11CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_12CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_13CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_14CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_15CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_16CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_DATA_LATENCY_17CLK))

#define         IS_FL_EPSC_NTR_ACCESS_MODE(__VALUE__)           (((__VALUE__) == FL_EPSC_NTR_EXTMOD_MODE_A)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_EXTMOD_MODE_B)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_EXTMOD_MODE_C||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NTR_EXTMOD_MODE_D)))

#define         IS_FL_EPSC_NWTR_TURNAROUND_TIME(__VALUE__)      (((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_0CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_1CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_2CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_3CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_4CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_5CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_6CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_7CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_8CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_9CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_10CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_11CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_12CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_13CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_14CLK)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_BUS_TRUNAROUND_15CLK))

