waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Src/fm33fk5xx_fl_epsc.c
#define         IS_FL_EPSC_NWTR_ACCESS_MODE(__VALUE__)          (((__VALUE__) == FL_EPSC_NWTR_EXTMOD_MODE_A)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_EXTMOD_MODE_B)||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_EXTMOD_MODE_C||\
                                                                                                                                    ((__VALUE__) == FL_EPSC_NWTR_EXTMOD_MODE_D)))
/**
  * @brief  恢复对应的EPSC入口地址寄存器为默认值
  *
  * @param  EPSCx  外设入口地址
  *
  * @retval ErrorStatus枚举值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS EPSC配置成功
  */
FL_ErrorStatus  FL_EPSC_NORSRAM_DeInit(EPSC_Type *EPSCx)
{
    FL_ErrorStatus status = FL_PASS;
    /* 入口合法性检查 */
    assert_param(IS_FL_EPSC_INSTANCE(EPSCx));
    /* 外设复位使能 */
    FL_RMU_EnablePeripheralReset(RMU);
    FL_RMU_EnableResetAPBPeripheral(RMU, FL_RMU_RSTAPB_EPSC);
    FL_RMU_DisableResetAPBPeripheral(RMU, FL_RMU_RSTAPB_EPSC);
    FL_RMU_EnableResetAPBPeripheral(RMU, FL_RMU_RSTAPB_EPSC);
    FL_RMU_DisableResetAPBPeripheral(RMU, FL_RMU_RSTAPB_EPSC);
    FL_RMU_DisablePeripheralReset(RMU);
    return status;
}
/**
  * @brief  初始化EPSCx指定的入口地址的外设寄存器
  *
  * @param  EPSCx  外设入口地址
  * @param  EPSC_InitStruct 指向一 @ref EPSC_NORSRAM_InitTypeDef 结构体，它包含指定EPSC外设的配置信息
  *
  * @retval ErrorStatus枚举值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS EPSC配置成功
  */
FL_ErrorStatus FL_EPSC_NORSRAM_Init(EPSC_Type *EPSCx, EPSC_NORSRAM_InitTypeDef  *EPSC_InitStruct)
{
    FL_ErrorStatus status = FL_FAIL;

    if(EPSC_InitStruct != NULL)
    {
        assert_param(IS_FL_EPSC_NORSRAM_BANK(EPSC_InitStruct->NSBank));
        assert_param(IS_FL_EPSC_MUX(EPSC_InitStruct->DataAddressMux));
        assert_param(IS_FL_EPSC_MEMORY(EPSC_InitStruct->MemoryType));
        assert_param(IS_FL_EPSC_MEMORY_WIDTH(EPSC_InitStruct->MemoryDataWidth));
        assert_param(IS_FL_EPSC_BURSTMODE(EPSC_InitStruct->BurstAccessMode));
        assert_param(IS_FL_EPSC_WRITE_BURST(EPSC_InitStruct->WriteBurst));
        assert_param(IS_FL_EPSC_WAITE_SIGNAL(EPSC_InitStruct->WaitSignal));
        assert_param(IS_FL_EPSC_ASYNWAIT(EPSC_InitStruct->AsynchronousWait));
        assert_param(IS_FL_EPSC_WAIT_POLARITY(EPSC_InitStruct->WaitSignalPolarity));
        assert_param(IS_FL_EPSC_WAIT_SIGNAL_ACTIVE(EPSC_InitStruct->WaitSignalActive));
        assert_param(IS_FL_EPSC_WRITE_OPERATION(EPSC_InitStruct->WriteOperation));
        assert_param(IS_FL_EPSC_EXTENDED_MODE(EPSC_InitStruct->ExtendedMode));
        assert_param(IS_FL_EPSC_ADDRESS_SETUP_TIME(EPSC_InitStruct->ReadWriteTimingStruct->AddressSetupTime));
        assert_param(IS_FL_EPSC_ADDRESS_HOLD_TIME(EPSC_InitStruct->ReadWriteTimingStruct->AddressHoldTime));
        assert_param(IS_FL_EPSC_DATASETUP_TIME(EPSC_InitStruct->ReadWriteTimingStruct->DataSetupTime));
        assert_param(IS_FL_EPSC_NTR_TURNAROUND_TIME(EPSC_InitStruct->ReadWriteTimingStruct->BusTurnAroundDuration));
        assert_param(IS_FL_EPSC_NTR_CLK_DIV(EPSC_InitStruct->ReadWriteTimingStruct->CLKDivision));
        assert_param(IS_FL_EPSC_NTR_DATA_LATENCY(EPSC_InitStruct->ReadWriteTimingStruct->DataLatency));
        assert_param(IS_FL_EPSC_NTR_ACCESS_MODE(EPSC_InitStruct->ReadWriteTimingStruct->AccessMode));

        FL_CMU_EnableGroup3BusClock(FL_CMU_GROUP3_BUSCLK_EPSC);
        switch(EPSC_InitStruct->NSBank)
        {
            case FL_EPSC_BANK1_NORSRAM1:
            {
                /*地址数据复用使能配置*/
                if(EPSC_InitStruct->DataAddressMux)
                {
                    FL_EPSC_EnableNCR1_DataAddressMux(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR1_DataAddressMux(EPSC);
                }
                /*存储器类型配置*/
                FL_EPSC_SetNCR1_MemoryType(EPSC, EPSC_InitStruct->MemoryType);
                /*存储器总线宽度配置*/
                FL_EPSC_SetNCR1_MemoryBusWidth(EPSC, EPSC_InitStruct->MemoryDataWidth);
                /*存储器突发模式使能配置*/
                if(EPSC_InitStruct->BurstAccessMode)
                {
                    FL_EPSC_EnableNCR1_BurstMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR1_BurstMode(EPSC);
                }
                /*burst模式写操作配置*/
                FL_EPSC_SetNCR1_writeBurstMode(EPSC, EPSC_InitStruct->WriteBurst);
                /*wait使能配置*/
                if(EPSC_InitStruct->WaitSignal)
                {
                    FL_EPSC_EnableNCR1_WaitMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR1_WaitMode(EPSC);
                }
                /*异步模式下wait配置*/
                if(EPSC_InitStruct->AsynchronousWait)
                {
                    FL_EPSC_EnableNCR1_AsynchronousWait(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR1_AsynchronousWait(EPSC);
                }
                /*wait模式信号配置*/
                FL_EPSC_SetNCR1_WaitPolarity(EPSC, EPSC_InitStruct->WaitSignalPolarity);
                /*wait时序配置*/
                FL_EPSC_SetNCR1_WaitTimingMode(EPSC, EPSC_InitStruct->WaitSignalActive);
                /*写操作配置*/
                if(EPSC_InitStruct->WriteOperation)
                {
                    FL_EPSC_EnableNCR1_WriteMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR1_WriteMode(EPSC);
                }
                /*扩展模式配置*/
                if(EPSC_InitStruct->ExtendedMode)
                {
                    FL_EPSC_EnableNCR1_ExtendedMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR1_ExtendedMode(EPSC);
                }
                /*地址建立时间配置*/
                FL_EPSC_WriteNTR1_AddressSetState(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->AddressSetupTime);
                /*地址保持时间配置*/
                FL_EPSC_WriteNTR1_AddressHoldState(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->AddressHoldTime);
                /*数据段长度配置*/
                FL_EPSC_WriteNTR1_DataState(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->DataSetupTime);
                /*总线转空闲时间配置*/
                FL_EPSC_SetNTR1_BusTurnaroundCycle(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->BusTurnAroundDuration);
                /*EPSC_CLK分频比配置*/
                FL_EPSC_SetNTR1_ClkPerscale(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->CLKDivision);
                /*同步存储器数据延迟配置*/
                FL_EPSC_SetNTR1_DataLatencyCycle(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->DataLatency);
                /*扩展模式选择配置*/
                FL_EPSC_SetNTR1_ExtendedMode(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->AccessMode);
                if(EPSC_InitStruct->ExtendedMode == FL_ENABLE)
                {
                    assert_param(IS_FL_EPSC_ADDRESS_SETUP_TIME(EPSC_InitStruct->WriteTimingStruct->AddressSetupTime));
                    assert_param(IS_FL_EPSC_ADDRESS_HOLD_TIME(EPSC_InitStruct->WriteTimingStruct->AddressHoldTime));
                    assert_param(IS_FL_EPSC_DATASETUP_TIME(EPSC_InitStruct->WriteTimingStruct->DataSetupTime));
                    assert_param(IS_FL_EPSC_NWTR_TURNAROUND_TIME(EPSC_InitStruct->WriteTimingStruct->BusTurnAroundDuration));
                    assert_param(IS_FL_EPSC_NWTR_ACCESS_MODE(EPSC_InitStruct->WriteTimingStruct->AccessMode));
                    /*地址建立时间配置*/
                    FL_EPSC_WriteNWTR1_AddressSetState(EPSC, EPSC_InitStruct->WriteTimingStruct->AddressSetupTime);
                    /*地址保持时间配置*/
                    FL_EPSC_WriteNWTR1_AddressHoldState(EPSC, EPSC_InitStruct->WriteTimingStruct->AddressHoldTime);
                    /*数据段长度配置*/
                    FL_EPSC_WriteNWTR1_DataState(EPSC, EPSC_InitStruct->WriteTimingStruct->DataSetupTime);
                    /*总线转空闲时间配置*/
                    FL_EPSC_SetNWTR1_BusTurnaroundCycle(EPSC, EPSC_InitStruct->WriteTimingStruct->BusTurnAroundDuration);
                    /*扩展模式选择配置*/
                    FL_EPSC_SetNWTR1_ExtendedMode(EPSC, EPSC_InitStruct->WriteTimingStruct->AccessMode);
                }
                FL_EPSC_EnableNCR1_MemoryBank(EPSC);
                status = FL_PASS;
                break;
            }
            case FL_EPSC_BANK1_NORSRAM2:
            {
                /*地址数据复用使能配置*/
                if(EPSC_InitStruct->DataAddressMux)
                {
                    FL_EPSC_EnableNCR2_DataAddressMux(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR2_DataAddressMux(EPSC);
                }
                /*存储器类型配置*/
                FL_EPSC_SetNCR2_MemoryType(EPSC, EPSC_InitStruct->MemoryType);
                /*存储器总线宽度配置*/
                FL_EPSC_SetNCR2_MemoryBusWidth(EPSC, EPSC_InitStruct->MemoryDataWidth);
                /*存储器突发模式使能配置*/
                if(EPSC_InitStruct->BurstAccessMode)
                {
                    FL_EPSC_EnableNCR2_BurstMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR2_BurstMode(EPSC);
                }
                /*burst模式写操作配置*/
                FL_EPSC_SetNCR2_writeBurstMode(EPSC, EPSC_InitStruct->WriteBurst);
                /*wait使能配置*/
                if(EPSC_InitStruct->WaitSignal)
                {
                    FL_EPSC_EnableNCR2_WaitMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR2_WaitMode(EPSC);
                }
                /*异步模式下wait配置*/
                if(EPSC_InitStruct->AsynchronousWait)
                {
                    FL_EPSC_EnableNCR2_AsynchronousWait(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR2_AsynchronousWait(EPSC);
                }
                /*wait模式信号配置*/
                FL_EPSC_SetNCR2_WaitPolarity(EPSC, EPSC_InitStruct->WaitSignalPolarity);
                /*wait时序配置*/
                FL_EPSC_SetNCR2_WaitTimingMode(EPSC, EPSC_InitStruct->WaitSignalActive);
                /*写操作配置*/
                if(EPSC_InitStruct->WriteOperation)
                {
                    FL_EPSC_EnableNCR2_WriteMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR2_WriteMode(EPSC);
                }
                /*扩展模式配置*/
                if(EPSC_InitStruct->ExtendedMode)
                {
                    FL_EPSC_EnableNCR2_ExtendedMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR2_ExtendedMode(EPSC);
                }
                /*地址建立时间配置*/
                FL_EPSC_WriteNTR2_AddressSetState(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->AddressSetupTime);
                /*地址保持时间配置*/
                FL_EPSC_WriteNTR2_AddressHoldState(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->AddressHoldTime);
                /*数据段长度配置*/
                FL_EPSC_WriteNTR2_DataState(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->DataSetupTime);
                /*总线转空闲时间配置*/
                FL_EPSC_SetNTR2_BusTurnaroundCycle(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->BusTurnAroundDuration);
                /*EPSC_CLK分频比配置*/
                FL_EPSC_SetNTR2_ClkPerscale(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->CLKDivision);
                /*同步存储器数据延迟配置*/
                FL_EPSC_SetNTR2_DataLatencyCycle(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->DataLatency);
                /*扩展模式选择配置*/
                FL_EPSC_SetNTR2_ExtendedMode(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->AccessMode);
                if(EPSC_InitStruct->ExtendedMode == FL_ENABLE)
                {
                    assert_param(IS_FL_EPSC_ADDRESS_SETUP_TIME(EPSC_InitStruct->WriteTimingStruct->AddressSetupTime));
                    assert_param(IS_FL_EPSC_ADDRESS_HOLD_TIME(EPSC_InitStruct->WriteTimingStruct->AddressHoldTime));
                    assert_param(IS_FL_EPSC_DATASETUP_TIME(EPSC_InitStruct->WriteTimingStruct->DataSetupTime));
                    assert_param(IS_FL_EPSC_NWTR_TURNAROUND_TIME(EPSC_InitStruct->WriteTimingStruct->BusTurnAroundDuration));
                    assert_param(IS_FL_EPSC_NWTR_ACCESS_MODE(EPSC_InitStruct->WriteTimingStruct->AccessMode));
                    /*地址建立时间配置*/
                    FL_EPSC_WriteNWTR2_AddressSetState(EPSC, EPSC_InitStruct->WriteTimingStruct->AddressSetupTime);
                    /*地址保持时间配置*/
                    FL_EPSC_WriteNWTR2_AddressHoldState(EPSC, EPSC_InitStruct->WriteTimingStruct->AddressHoldTime);
                    /*数据段长度配置*/
                    FL_EPSC_WriteNWTR2_DataState(EPSC, EPSC_InitStruct->WriteTimingStruct->DataSetupTime);
                    /*总线转空闲时间配置*/
                    FL_EPSC_SetNWTR2_BusTurnaroundCycle(EPSC, EPSC_InitStruct->WriteTimingStruct->BusTurnAroundDuration);
                    /*扩展模式选择配置*/
                    FL_EPSC_SetNWTR2_ExtendedMode(EPSC, EPSC_InitStruct->WriteTimingStruct->AccessMode);
                }
                FL_EPSC_EnableNCR2_MemoryBank(EPSC);
                status = FL_PASS;
                break;
            }
            case FL_EPSC_BANK1_NORSRAM3:
            {
                /*地址数据复用使能配置*/
                if(EPSC_InitStruct->DataAddressMux)
                {
                    FL_EPSC_EnableNCR3_DataAddressMux(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR3_DataAddressMux(EPSC);
                }
                /*存储器类型配置*/
                FL_EPSC_SetNCR3_MemoryType(EPSC, EPSC_InitStruct->MemoryType);
                /*存储器总线宽度配置*/
                FL_EPSC_SetNCR3_MemoryBusWidth(EPSC, EPSC_InitStruct->MemoryDataWidth);
                /*存储器突发模式使能配置*/
                if(EPSC_InitStruct->BurstAccessMode)
                {
                    FL_EPSC_EnableNCR3_BurstMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR3_BurstMode(EPSC);
                }
                /*burst模式写操作配置*/
                FL_EPSC_SetNCR3_writeBurstMode(EPSC, EPSC_InitStruct->WriteBurst);
                /*wait使能配置*/
                if(EPSC_InitStruct->WaitSignal)
                {
                    FL_EPSC_EnableNCR3_WaitMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR3_WaitMode(EPSC);
                }
                /*异步模式下wait配置*/
                if(EPSC_InitStruct->AsynchronousWait)
                {
                    FL_EPSC_EnableNCR3_AsynchronousWait(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR3_AsynchronousWait(EPSC);
                }
                /*wait模式信号配置*/
                FL_EPSC_SetNCR3_WaitPolarity(EPSC, EPSC_InitStruct->WaitSignalPolarity);
                /*wait时序配置*/
                FL_EPSC_SetNCR3_WaitTimingMode(EPSC, EPSC_InitStruct->WaitSignalActive);
                /*写操作配置*/
                if(EPSC_InitStruct->WriteOperation)
                {
                    FL_EPSC_EnableNCR3_WriteMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR3_WriteMode(EPSC);
                }
                /*扩展模式配置*/
                if(EPSC_InitStruct->ExtendedMode)
                {
                    FL_EPSC_EnableNCR3_ExtendedMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR3_ExtendedMode(EPSC);
                }
                /*地址建立时间配置*/
                FL_EPSC_WriteNTR3_AddressSetState(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->AddressSetupTime);
                /*地址保持时间配置*/
                FL_EPSC_WriteNTR3_AddressHoldState(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->AddressHoldTime);
                /*数据段长度配置*/
                FL_EPSC_WriteNTR3_DataState(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->DataSetupTime);
                /*总线转空闲时间配置*/
                FL_EPSC_SetNTR3_BusTurnaroundCycle(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->BusTurnAroundDuration);
                /*EPSC_CLK分频比配置*/
                FL_EPSC_SetNTR3_ClkPerscale(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->CLKDivision);
                /*同步存储器数据延迟配置*/
                FL_EPSC_SetNTR3_DataLatencyCycle(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->DataLatency);
                /*扩展模式选择配置*/
                FL_EPSC_SetNTR3_ExtendedMode(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->AccessMode);
                if(EPSC_InitStruct->ExtendedMode == FL_ENABLE)
                {
                    assert_param(IS_FL_EPSC_ADDRESS_SETUP_TIME(EPSC_InitStruct->WriteTimingStruct->AddressSetupTime));
                    assert_param(IS_FL_EPSC_ADDRESS_HOLD_TIME(EPSC_InitStruct->WriteTimingStruct->AddressHoldTime));
                    assert_param(IS_FL_EPSC_DATASETUP_TIME(EPSC_InitStruct->WriteTimingStruct->DataSetupTime));
                    assert_param(IS_FL_EPSC_NWTR_TURNAROUND_TIME(EPSC_InitStruct->WriteTimingStruct->BusTurnAroundDuration));
                    assert_param(IS_FL_EPSC_NWTR_ACCESS_MODE(EPSC_InitStruct->WriteTimingStruct->AccessMode));
                    /*地址建立时间配置*/
                    FL_EPSC_WriteNWTR3_AddressSetState(EPSC, EPSC_InitStruct->WriteTimingStruct->AddressSetupTime);
                    /*地址保持时间配置*/
                    FL_EPSC_WriteNWTR3_AddressHoldState(EPSC, EPSC_InitStruct->WriteTimingStruct->AddressHoldTime);
                    /*数据段长度配置*/
                    FL_EPSC_WriteNWTR3_DataState(EPSC, EPSC_InitStruct->WriteTimingStruct->DataSetupTime);
                    /*总线转空闲时间配置*/
                    FL_EPSC_SetNWTR3_BusTurnaroundCycle(EPSC, EPSC_InitStruct->WriteTimingStruct->BusTurnAroundDuration);
                    /*扩展模式选择配置*/
                    FL_EPSC_SetNWTR3_ExtendedMode(EPSC, EPSC_InitStruct->WriteTimingStruct->AccessMode);
                }
                FL_EPSC_EnableNCR3_MemoryBank(EPSC);
                status = FL_PASS;
                break;
            }
            case FL_EPSC_BANK1_NORSRAM4:
            {
                /*地址数据复用使能配置*/
                if(EPSC_InitStruct->DataAddressMux)
                {
                    FL_EPSC_EnableNCR4_DataAddressMux(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR4_DataAddressMux(EPSC);
                }
                /*存储器类型配置*/
                FL_EPSC_SetNCR4_MemoryType(EPSC, EPSC_InitStruct->MemoryType);
                /*存储器总线宽度配置*/
                FL_EPSC_SetNCR4_MemoryBusWidth(EPSC, EPSC_InitStruct->MemoryDataWidth);
                /*存储器突发模式使能配置*/
                if(EPSC_InitStruct->BurstAccessMode)
                {
                    FL_EPSC_EnableNCR4_BurstMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR4_BurstMode(EPSC);
                }
                /*burst模式写操作配置*/
                FL_EPSC_SetNCR4_writeBurstMode(EPSC, EPSC_InitStruct->WriteBurst);
                /*wait使能配置*/
                if(EPSC_InitStruct->WaitSignal)
                {
                    FL_EPSC_EnableNCR4_WaitMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR4_WaitMode(EPSC);
                }
                /*异步模式下wait配置*/
                if(EPSC_InitStruct->AsynchronousWait)
                {
                    FL_EPSC_EnableNCR4_AsynchronousWait(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR4_AsynchronousWait(EPSC);
                }
                /*wait模式信号配置*/
                FL_EPSC_SetNCR4_WaitPolarity(EPSC, EPSC_InitStruct->WaitSignalPolarity);
                /*wait时序配置*/
                FL_EPSC_SetNCR4_WaitTimingMode(EPSC, EPSC_InitStruct->WaitSignalActive);
                /*写操作配置*/
                if(EPSC_InitStruct->WriteOperation)
                {
                    FL_EPSC_EnableNCR4_WriteMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR4_WriteMode(EPSC);
                }
                /*扩展模式配置*/
                if(EPSC_InitStruct->ExtendedMode)
                {
                    FL_EPSC_EnableNCR4_ExtendedMode(EPSC);
                }
                else
                {
                    FL_EPSC_DisableNCR4_ExtendedMode(EPSC);
                }
                /*地址建立时间配置*/
                FL_EPSC_WriteNTR4_AddressSetState(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->AddressSetupTime);
                /*地址保持时间配置*/
                FL_EPSC_WriteNTR4_AddressHoldState(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->AddressHoldTime);
                /*数据段长度配置*/
                FL_EPSC_WriteNTR4_DataState(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->DataSetupTime);
                /*总线转空闲时间配置*/
                FL_EPSC_SetNTR4_BusTurnaroundCycle(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->BusTurnAroundDuration);
                /*EPSC_CLK分频比配置*/
                FL_EPSC_SetNTR4_ClkPerscale(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->CLKDivision);
                /*同步存储器数据延迟配置*/
                FL_EPSC_SetNTR4_DataLatencyCycle(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->DataLatency);
                /*扩展模式选择配置*/
                FL_EPSC_SetNTR4_ExtendedMode(EPSC, EPSC_InitStruct->ReadWriteTimingStruct->AccessMode);
                if(EPSC_InitStruct->ExtendedMode == FL_ENABLE)
                {
                    assert_param(IS_FL_EPSC_ADDRESS_SETUP_TIME(EPSC_InitStruct->WriteTimingStruct->AddressSetupTime));
                    assert_param(IS_FL_EPSC_ADDRESS_HOLD_TIME(EPSC_InitStruct->WriteTimingStruct->AddressHoldTime));
                    assert_param(IS_FL_EPSC_DATASETUP_TIME(EPSC_InitStruct->WriteTimingStruct->DataSetupTime));
                    assert_param(IS_FL_EPSC_NWTR_TURNAROUND_TIME(EPSC_InitStruct->WriteTimingStruct->BusTurnAroundDuration));
                    assert_param(IS_FL_EPSC_NWTR_ACCESS_MODE(EPSC_InitStruct->WriteTimingStruct->AccessMode));
                    /*地址建立时间配置*/
                    FL_EPSC_WriteNWTR4_AddressSetState(EPSC, EPSC_InitStruct->WriteTimingStruct->AddressSetupTime);
                    /*地址保持时间配置*/
                    FL_EPSC_WriteNWTR4_AddressHoldState(EPSC, EPSC_InitStruct->WriteTimingStruct->AddressHoldTime);
                    /*数据段长度配置*/
                    FL_EPSC_WriteNWTR4_DataState(EPSC, EPSC_InitStruct->WriteTimingStruct->DataSetupTime);
                    /*总线转空闲时间配置*/
                    FL_EPSC_SetNWTR4_BusTurnaroundCycle(EPSC, EPSC_InitStruct->WriteTimingStruct->BusTurnAroundDuration);
                    /*扩展模式选择配置*/
                    FL_EPSC_SetNWTR4_ExtendedMode(EPSC, EPSC_InitStruct->WriteTimingStruct->AccessMode);
                }
                FL_EPSC_EnableNCR4_MemoryBank(EPSC);
                status = FL_PASS;
                break;
            }
            default:
                status = FL_FAIL;
        }
    }

