waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Src/fm33fk5xx_fl_epsc.c
    return status;
}

/**
  * @brief  设置 EPSC_InitStruct 为默认配置
  * @param  EPSC_InitStruct 指向需要将值设置为默认配置的结构体 @ref EPSC_NORSRAM_InitTypeDef 结构体
  *
  * @retval None
  */
void FL_EPSC_NORSRAM_StructInit(EPSC_NORSRAM_InitTypeDef *EPSC_InitStruct)
{
    if(EPSC_InitStruct != NULL)
    {
        EPSC_InitStruct->NSBank = FL_EPSC_BANK1_NORSRAM4;
        EPSC_InitStruct->DataAddressMux = FL_DISABLE;
        EPSC_InitStruct->MemoryType = FL_EPSC_NCR_MEMORY_TYPE_SRAM;
        EPSC_InitStruct->MemoryDataWidth = FL_EPSC_NCR_MEMORY_WIDTH_16B;
        EPSC_InitStruct->BurstAccessMode = FL_DISABLE;
        EPSC_InitStruct->WriteBurst = FL_DISABLE;
        EPSC_InitStruct->WaitSignal = FL_DISABLE;
        EPSC_InitStruct->AsynchronousWait = FL_DISABLE;
        EPSC_InitStruct->WaitSignalPolarity = FL_EPSC_NCR_POLARITY_LOW;
        EPSC_InitStruct->WaitSignalActive = FL_EPSC_NCR_ACTIVE_STATE_BEFORE;
        EPSC_InitStruct->WriteOperation = FL_ENABLE;
        EPSC_InitStruct->ExtendedMode = FL_ENABLE;

        EPSC_InitStruct->ReadWriteTimingStruct->AddressSetupTime = 0xFF;
        EPSC_InitStruct->ReadWriteTimingStruct->AddressHoldTime = 0xFF;
        EPSC_InitStruct->ReadWriteTimingStruct->DataSetupTime = 0xFF;
        EPSC_InitStruct->ReadWriteTimingStruct->BusTurnAroundDuration = FL_EPSC_NTR_BUS_TRUNAROUND_15CLK;
        EPSC_InitStruct->ReadWriteTimingStruct->CLKDivision = FL_EPSC_NTR_CLK_DIV16;
        EPSC_InitStruct->ReadWriteTimingStruct->DataLatency = FL_EPSC_NTR_DATA_LATENCY_17CLK;
        EPSC_InitStruct->ReadWriteTimingStruct->AccessMode = FL_EPSC_NTR_EXTMOD_MODE_A;

        EPSC_InitStruct->WriteTimingStruct->AddressSetupTime = 0xFF;
        EPSC_InitStruct->WriteTimingStruct->AddressHoldTime = 0xFF;
        EPSC_InitStruct->WriteTimingStruct->DataSetupTime = 0xFF;
        EPSC_InitStruct->WriteTimingStruct->BusTurnAroundDuration = FL_EPSC_NWTR_BUS_TRUNAROUND_15CLK;
        EPSC_InitStruct->WriteTimingStruct->AccessMode = FL_EPSC_NWTR_EXTMOD_MODE_A;

    }
}

/**
  * @}
  */

#endif /* FL_EPSC_DRIVER_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/********************** (C) COPYRIGHT Fudan Microelectronics **** END OF FILE ***********************/
